testing/case_1p2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "20000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
10981
(
(0.00572788 -1.45308e-05 -1.18879e-23)
(0.0117042 -3.52109e-05 7.71951e-24)
(0.00625969 -4.29013e-05 -1.25293e-23)
(0.00553202 -1.14171e-05 -2.78404e-23)
(0.015111 -2.96773e-05 -5.07187e-24)
(0.0122438 -0.000107567 -1.92618e-21)
(0.011866 1.30556e-05 0)
(0.00641188 -0.000307853 1.04675e-19)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
