testing/case_1p2/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
4.16407e-06
3.87636e-06
4.08118e-06
4.2968e-06
3.0483e-06
3.62378e-06
4.30739e-06
3.76133e-06
...
)
;

boundaryField
{
    bottomWall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
139
(
4.16407e-06
4.08118e-06
3.76133e-06
3.42156e-06
2.97513e-06
2.43946e-06
1.9276e-06
1.52737e-06
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
139
(
1.67554e-06
1.68226e-06
1.68756e-06
1.69025e-06
1.6873e-06
1.67969e-06
1.66463e-06
1.64283e-06
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
