testing/case_1p2/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
3.74748e-06
2.196e-05
3.67216e-06
3.86678e-06
2.7072e-05
2.12979e-05
2.29841e-05
3.38228e-06
...
)
;

boundaryField
{
    bottomWall
    {
        type            kLowReWallFunction;
        Ceps2           1.9;
        value           nonuniform List<scalar> 
139
(
5.75243e-08
5.52653e-08
4.69917e-08
3.81521e-08
2.68547e-08
1.55966e-08
8.30273e-09
4.65607e-09
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            kLowReWallFunction;
        Ceps2           1.9;
        value           nonuniform List<scalar> 
139
(
9.56885e-09
9.64481e-09
9.75283e-09
9.97744e-09
1.0339e-08
1.08593e-08
1.1571e-08
1.23866e-08
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
