testing/case_1p2/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    x05
    {
        type            lineUniform;
        axis            y;
        start           (0.5 0.0   0.05);
        end             (0.5 3.0 0.05);
        nPoints         2000;
    }
    x15
    {
        type            lineUniform;
        axis            y;
        start           (1.5 0.0    0.05);
        end             (1.5 3.0  0.05);
        nPoints         2000;
    }
    x25
    {
        type            lineUniform;
        axis            y;
        start           (2.5 0.0    0.05);
        end             (2.5 3.0  0.05);
        nPoints         2000;
    }
    x35
    {
        type            lineUniform;
        axis            y;
        start           (3.5 0.0    0.05);
        end             (3.5 3.0  0.05);
        nPoints         2000;
    }
    x45
    {
        type            lineUniform;
        axis            y;
        start           (4.5 0.0    0.05);
        end             (4.5 3.0  0.05);
        nPoints         2000;
    }
    x55
    {
        type            lineUniform;
        axis            y;
        start           (5.5 0.0    0.05);
        end             (5.5 3.0  0.05);
        nPoints         2000;
    }
    x65
    {
        type            lineUniform;
        axis            y;
        start           (6.5 0.0    0.05);
        end             (6.5 3.0  0.05);
        nPoints         2000;
    }
    x75
    {
        type            lineUniform;
        axis            y;
        start           (7.5 0.0    0.05);
        end             (7.5 3.0  0.05);
        nPoints         2000;
    }
    x85
    {
        type            lineUniform;
        axis            y;
        start           (8.5 0.0    0.05);
        end             (8.5 3.0  0.05);
        nPoints         2000;
    }
    x95
    {
        type            lineUniform;
        axis            y;
        start           (9.5 0.0    0.05);
        end             (9.5 3.0  0.05);
        nPoints         2000;
    }
);

fields          (Rnew);

// ************************************************************************* //
